#include <iostream>
#include <print>
//#include <cstdint>

int main() {
    setlocale(LC_ALL, "RU");

    uint8_t size_mat;

    std::println("================================================================");
    std::println("          КОНСОЛЬНЫЙ МАТРИЧНЫЙ КАЛЬКУЛЯТОР v2.0 [C++26]");
    std::println("                     МАКЕТЫ ИНТЕРФЕЙСНЫХ ОКНО");
    std::println("================================================================\n");

    std::println("1. Операции над одной матрицей (Определитель, Ранг...)");
    std::println("2. Операции над двумя матрицами (Умножение, Сложение...)");
    std::println("3. Решение систем линейных уравнений (СЛАУ)");
    std::println("4. Работа с файлами (Импорт / Экспорт)");
    std::println("5. Настройки вывода (Обычные / Обыкновенные дроби)");
    std::println("6. Выход\n");

    std::print("----------------------------------------------------------------\n");
    std::print("Управление: Нажмите цифру [1-6] для выбора режима\n");
    std::print("================================================================");



    std::cin.get();
    return 0;
}